/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strtrim.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kmatsuna <kmatsuna@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/05/26 16:21:56 by kmatsuna          #+#    #+#             */
/*   Updated: 2024/05/26 16:52:23 by kmatsuna         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

char *ft_strtrim(const char *s1, char const *set)
{
    // size_t i;
    // size_t j;
    char *re;

    re = ft_substr(s1,0,ft_strlen(s1));

    return(re);

}

// --上から順にセット以外の文字がでてく流のを数える
// 初めてその文字列が出てきたらスターと地点
// ーー後ろから順番に数える
// 出てきたら終点地点
// それをsubstrに入れる